/// regular expression
/// 1. 空白符开头
/// 2. 第
/// 3. \s\d〇零一二两三四五六七八九十百千万壹贰叁肆伍陆柒捌玖拾佰仟 可重复多次，但是尽可能少
/// 4. 章部节卷集级片篇回
/// 5. 后面什么都没 或者 存在至少一个空格、下划线、-等特殊符号
/// 6. 至多20个字的章节描述
/// 7. 至少一个空白符结尾
List<RegExp> tocRegExpList = [
  RegExp(
      r'^\s*?(外传|序言｜前言)?\s*?第[\s\d〇零一二两三四五六七八九十百千万壹贰叁肆伍陆柒捌玖拾佰仟]+?[章部节卷集片篇回]([ -_]*(.{0,20})?)?\s*$'),
  // RegExp(
  //     r'^\s*?(外传|序言｜前言)?\s*?第[\s\d〇零一二两三四五六七八九十百千万壹贰叁肆伍陆柒捌玖拾佰仟]+?[章部节卷集片篇回]([ -_]+(.{0,20})?)?\s*$'),
  // RegExp(r'^\s*?(外传|序言｜前言)\s*?([ -_]+(.{0,10})?)?\s*$'),
  // 这种类型的标题格式一般是一致的，尽可能少的匹配
  RegExp(r'^\s*?[\[\(](.{1,20})[\)\]]\s*$'),
  RegExp(r'^\s*?[【](.{1,20})[】]\s*$'),
  RegExp(r'^\s*?[（](.{1,20})[）]\s*$'),
  RegExp(r'^\s*?[〈](.{1,20})[〉]\s*$'),
  RegExp(r'^\s*?[《](.{1,20})[》]\s*$'),
  RegExp(r'^\s*?[〔](.{1,20})[〕]\s*$'),
  RegExp(r'^\s*?[〖](.{1,20})[〗]\s*$'),
  RegExp(r'^\s*?[『](.{1,20})[』]\s*$'),
  RegExp(r'^\s*?[「](.{1,20})[」]\s*$'),
];
